nvme0n1_fio_results/dev-nvme0n1_2023-07-17_16:05/rand_r_nvme0n1_8iodepth_1threads/1024.txt
rand-read: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

rand-read: (groupid=0, jobs=1): err= 0: pid=6430: Mon Jul 17 16:24:06 2023
   read: IOPS=5352, BW=5353MiB/s (5613MB/s)(105GiB/20002msec)
    slat (usec): min=18, max=622, avg=32.93, stdev=15.73
    clat (usec): min=337, max=7006, avg=1460.37, stdev=568.62
     lat (usec): min=407, max=7027, avg=1493.46, stdev=568.03
    clat percentiles (usec):
     |  1.00th=[  644],  5.00th=[  783], 10.00th=[  865], 20.00th=[ 1004],
     | 30.00th=[ 1123], 40.00th=[ 1221], 50.00th=[ 1336], 60.00th=[ 1467],
     | 70.00th=[ 1631], 80.00th=[ 1860], 90.00th=[ 2212], 95.00th=[ 2573],
     | 99.00th=[ 3359], 99.50th=[ 3687], 99.90th=[ 4293], 99.95th=[ 4555],
     | 99.99th=[ 5342]
   bw (  MiB/s): min= 4510, max= 6708, per=100.00%, avg=5352.75, stdev=917.82, samples=40
   iops        : min= 4510, max= 6708, avg=5352.75, stdev=917.82, samples=40
  lat (usec)   : 500=0.10%, 750=3.48%, 1000=15.92%
  lat (msec)   : 2=65.34%, 4=14.92%, 10=0.23%
  cpu          : usr=1.18%, sys=20.66%, ctx=85149, majf=0, minf=2768
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=107063,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=5353MiB/s (5613MB/s), 5353MiB/s-5353MiB/s (5613MB/s-5613MB/s), io=105GiB (112GB), run=20002-20002msec

Disk stats (read/write):
  nvme0n1: ios=852438/0, merge=0/0, ticks=992019/0, in_queue=972063, util=99.61%