nvme0n1_fio_results/dev-nvme0n1_2023-07-17_16:05/rand_r_nvme0n1_8iodepth_1threads/8192.txt
rand-read: (g=0): rw=randread, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=8
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

rand-read: (groupid=0, jobs=1): err= 0: pid=6560: Mon Jul 17 16:25:08 2023
   read: IOPS=696, BW=5568MiB/s (5839MB/s)(109GiB/20011msec)
    slat (usec): min=152, max=2593, avg=207.71, stdev=80.98
    clat (usec): min=1548, max=28786, avg=11278.70, stdev=2845.23
     lat (usec): min=2806, max=28944, avg=11486.61, stdev=2843.35
    clat percentiles (usec):
     |  1.00th=[ 7373],  5.00th=[ 8029], 10.00th=[ 8455], 20.00th=[ 8979],
     | 30.00th=[ 9372], 40.00th=[ 9896], 50.00th=[10421], 60.00th=[11076],
     | 70.00th=[12256], 80.00th=[13566], 90.00th=[15401], 95.00th=[16909],
     | 99.00th=[19792], 99.50th=[21103], 99.90th=[24249], 99.95th=[25035],
     | 99.99th=[26870]
   bw (  MiB/s): min= 4512, max= 6736, per=99.99%, avg=5567.52, stdev=874.75, samples=40
   iops        : min=  564, max=  842, avg=695.90, stdev=109.38, samples=40
  lat (msec)   : 2=0.01%, 4=0.01%, 10=42.98%, 20=56.17%, 50=0.83%
  cpu          : usr=0.28%, sys=14.73%, ctx=12658, majf=0, minf=182
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=13928,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=5568MiB/s (5839MB/s), 5568MiB/s-5568MiB/s (5839MB/s-5839MB/s), io=109GiB (117GB), run=20011-20011msec

Disk stats (read/write):
  nvme0n1: ios=887212/0, merge=0/0, ticks=7050443/0, in_queue=7031767, util=99.56%